<!-- dflook/terraform-github-actions {"workspace":"tf-1-3-0-backend-version-detection-2","backend":"716f2075b0b1c8dce4af76a76b7be9618141dc777a633c712b761aa397abbc5e","backend_type":"remote","plan_job_ref":"Job Test Terraform cloud #63 at https://github.com/dflook/terraform-github-actions/actions/runs/3122832205","plan_hash":"e74713eba2bdf05e8b923655243128b39448e4d6b55cba51635fdd4844368851","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __tf-1-3-0-backend-version-detection-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables="from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #63](https://github.com/dflook/terraform-github-actions/actions/runs/3122832205)